#ifndef POINT_H
#define POINT_H

class Point {
public:
// Представляють координати точки в тривимірному просторі.
    float x;
    float y;
    float z;

// Конструктор за замовчуванням, який не приймає аргументів
// і ініціалізує всі координати точки значеннями за замовчуванням.
    Point(); 

// Конструктор, який приймає аргументи x і y
// і ініціалізує координати точки зазначеними значеннями, залишаючи z незмінним.
    Point(float x, float y);

// Конструктор, який приймає аргументи x, y і z 
// і ініціалізує всі координати точки зазначеними значеннями.
    Point(float x, float y, float z);
};

#endif
